In [7]:
import numpy as np
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [2]:
ysalmedian = df['salary_year_avg'].median()

In [ ]:
hsalmedian = df['salary_hour_avg'].median()

np.float64(45.97999954223633)

In [4]:
df_filled = df

df_filled['salary_year_avg'] = df_filled.salary_year_avg.fillna(ysalmedian)
df_filled['salary_hour_avg'] = df_filled.salary_hour_avg.fillna(hsalmedian)

In [5]:
df_filled.loc[:,'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [6]:
df_unique = df_filled.drop_duplicates()
print(f"Length of original df: {len(df_filled)}")
print(f"Length of drop duplicate df: {len(df_unique)}")
print(f"Rows dropped: {len(df_filled)-len(df_unique)}")

Length of original df: 785741
Length of drop duplicate df: 785640
Rows dropped: 101

In [10]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])
print(f"Length of original df: {len(df_filled)}")
print(f"Length of drop duplicate df: {len(df_unique)}")
print(f"Rows dropped: {len(df_filled)-len(df_unique)}")

Length of original df: 785741
Length of drop duplicate df: 508042
Rows dropped: 277699

In [14]:
df_unique.loc[:,['job_title_short','company_name']]

             job_title_short                        company_name
0       Senior Data Engineer                Boehringer Ingelheim
1               Data Analyst          Hewlett Packard Enterprise
2              Data Engineer            ALPHA Augmented Services
3              Data Engineer        Southwest Research Institute
4              Data Engineer                     Kristina Daniel
...                      ...                                 ...
785735  Senior Data Engineer                            Pure App
785736     Software Engineer  CAREERSTAR INTERNATIONAL PTE. LTD.
785737          Data Analyst                    HABA FAMILYGROUP
785738      Business Analyst               Lendlease Corporation
785740     Software Engineer                              Trigyn

[508042 rows x 2 columns]